-- Заполнение таблицы клиентов
INSERT INTO client (full_name) VALUES
('Иван Иванов'),
('Петр Петров'),
('Илья Богатов'),
('Алексей Алексеев'),
('Мария Марьева'),
('Ольга Ольгина'),
('Анна Малинина'),
('Дмитрий Дмитриев'),
('Елена Еленина'),
('Сергей Сергеев');

-- Заполнение таблицы тренеров
INSERT INTO trainer (full_name) VALUES
('Виталий Семенов'),
('Максим Петров'),
('Андрей Смирнов'),
('Роман Веселый'),
('Мария Надеждина'),
('Ульяна Ильгина'),
('Милана Малинина'),
('Александр Дмитриев'),
('Елена Борщева'),
('Василий Мирный');

-- Заполнение таблицы спортсменов
INSERT INTO athlete (full_name) VALUES
('Ярослав Филимонов'),
('Кирилл Орлов'),
('Степан Новиков'),
('Вячеслав Павлов'),
('Евгения Орлова'),
('Анастасия Яковлева'),
('София Новикова'),
('Ульяна Овчинникова'),
('Мирон Осипов'),
('Дмитрий Зверев');

-- Заполнение таблицы тренировок
INSERT INTO workout (client_id, training_date, total_sessions) VALUES
(1, '2023-10-01', 10),
(2, '2023-10-02', 15),
(3, '2023-10-03', 20),
(1, '2023-10-04', 5),
(4, '2023-10-05', 30),
(5, '2023-10-06', 12),
(6, '2023-10-07', 25),
(7, '2023-10-08', 8),
(8, '2023-10-09', 50),
(9, '2023-10-10', 18);

-- Заполнение таблицы результатов
INSERT INTO result (athlete_id, workout_id, result_date, total_sessions) VALUES
(1, 1, '2023-10-01', 2),
(2, 2, '2023-10-02', 1),
(3, 3, '2023-10-03', 3),
(1, 4, '2023-10-04', 1),
(4, 5, '2023-10-05', 5),
(5, 6, '2023-10-06', 2),
(6, 7, '2023-10-07', 1),
(7, 8, '2023-10-08', 4),
(8, 9, '2023-10-09', 2),
(9, 10, '2023-10-10', 3);
