
-- Заполнение таблицы Товар
INSERT INTO product (description, price, quantity) VALUES
('Товар 1', 100.00, 10),
('Товар 2', 200.00, 15),
('Товар 3', 150.50, 20),
('Товар 4', 300.00, 5),
('Товар 5', 75.25, 30),
('Товар 6', 125.00, 12),
('Товар 7', 50.50, 25),
('Товар 8', 400.00, 8),
('Товар 9', 60.00, 50),
('Товар 10', 90.00, 18);


-- Заполнение таблицы Заказ
INSERT INTO orders (product_id, customer_id, order_date, quantity) VALUES
(1, 1, '2023-10-01', 2),
(2, 2, '2023-10-02', 1),
(3, 3, '2023-10-03', 3),
(4, 1, '2023-10-04', 1),
(5, 4, '2023-10-05', 5),
(6, 5, '2023-10-06', 2),
(7, 6, '2023-10-07', 1),
(8, 7, '2023-10-08', 4),
(9, 8, '2023-10-09', 2),
(10, 9, '2023-10-10', 3);


-- Заполнение таблицы Покупатель
INSERT INTO users (full_name) VALUES
('Иван Иванов'),
('Петр Петров'),
('Илья Богатов'),
('Алексей Алексеев'),
('Мария Марьева'),
('Ольга Ольгина'),
('Анна Малинина'),
('Дмитрий Дмитриев'),
('Елена Еленина'),
('Сергей Сергеев');